{
  "intents": [
    {
      "intent": "course_info",
      "examples": [
        "Tell me about your courses",
        "What training programs do you offer?",
        "What are your courses in renewable energy?",
        "Can you tell me about your solar energy course?"
      ],
      "responses": [
        "We offer courses on solar energy, wind energy, and waste management.",
        "Our training programs include solar energy, wind energy, and waste management. Learn and grow!"
      ]
    },
    {
      "intent": "career_guidance",
      "examples": [
        "I want career guidance",
        "Can you help me with my career path?",
        "How do I pursue a career in renewable energy?"
      ],
      "responses": [
        "The renewable energy field is booming! Would you like suggestions for certifications or job roles?",
        "Green energy careers are in high demand. Roles like sustainability analyst and energy consultant are popular!"
      ]
    },
    {
      "intent": "renewable_energy_advantages",
      "examples": [
        "What are the benefits of renewable energy?",
        "Tell me the advantages of renewable energy",
        "Why should we use renewable energy?"
      ],
      "responses": [
        "Renewable energy helps combat climate change by reducing carbon emissions.",
        "Using renewable energy can lower your electricity bills and promote energy independence."
      ]
    },
    {
      "intent": "job_opportunities",
      "examples": [
        "What are the job opportunities?",
        "Tell me about renewable energy jobs",
        "What roles are available in renewable energy?"
      ],
      "responses": [
        "Popular roles include renewable energy engineer, solar technician, and energy auditor.",
        "The demand for skilled professionals in renewable energy is rapidly growing worldwide."
      ]
    },
    {
      "intent": "fun_facts",
      "examples": [
        "Tell me a fun fact",
        "Share a renewable energy fun fact",
        "Can you tell me something interesting?"
      ],
      "responses": [
        "Did you know? The energy from the sun in one hour is enough to power the Earth for a year!",
        "Wind turbines can reach heights taller than the Statue of Liberty!",
        "Recycling one aluminum can saves enough energy to power a TV for three hours.",
        "Hydropower is the oldest form of renewable energy, dating back to ancient Greece!"
      ]
    }
  ]
}
